espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32TG11B/Include/efm32tg11b_lcd.h
/***************************************************************************//**
 * @file
 * @brief EFM32TG11B_LCD register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFM32TG11B_LCD LCD
 * @{
 * @brief EFM32TG11B_LCD Register Declaration
 ******************************************************************************/
/** LCD Register Declaration */
typedef struct {
  __IOM uint32_t CTRL;           /**< Control Register  */
  __IOM uint32_t DISPCTRL;       /**< Display Control Register  */
  __IOM uint32_t SEGEN;          /**< Segment Enable Register  */
  __IOM uint32_t BACTRL;         /**< Blink and Animation Control Register  */
  __IM uint32_t  STATUS;         /**< Status Register  */
  __IOM uint32_t AREGA;          /**< Animation Register a  */
  __IOM uint32_t AREGB;          /**< Animation Register B  */
  __IM uint32_t  IF;             /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;            /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;            /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;            /**< Interrupt Enable Register  */

  uint32_t       RESERVED0[1U];  /**< Reserved for future use **/
  __IOM uint32_t BIASCTRL;       /**< Analog BIAS Control  */

  uint32_t       RESERVED1[3U];  /**< Reserved for future use **/
  __IOM uint32_t SEGD0L;         /**< Segment Data Low Register 0  */
  __IOM uint32_t SEGD1L;         /**< Segment Data Low Register 1  */
  __IOM uint32_t SEGD2L;         /**< Segment Data Low Register 2  */
  __IOM uint32_t SEGD3L;         /**< Segment Data Low Register 3  */
  __IOM uint32_t SEGD0H;         /**< Segment Data High Register 0  */
  __IOM uint32_t SEGD1H;         /**< Segment Data High Register 1  */
  __IOM uint32_t SEGD2H;         /**< Segment Data High Register 2  */
  __IOM uint32_t SEGD3H;         /**< Segment Data High Register 3  */
  __IOM uint32_t SEGD4L;         /**< Segment Data Low Register 4  */
  __IOM uint32_t SEGD5L;         /**< Segment Data Low Register 5  */
  __IOM uint32_t SEGD6L;         /**< Segment Data Low Register 6  */
  __IOM uint32_t SEGD7L;         /**< Segment Data Low Register 7  */
  __IOM uint32_t SEGD4H;         /**< Segment Data High Register 4  */
  __IOM uint32_t SEGD5H;         /**< Segment Data High Register 5  */
  __IOM uint32_t SEGD6H;         /**< Segment Data High Register 6  */
  __IOM uint32_t SEGD7H;         /**< Segment Data High Register 7  */
  uint32_t       RESERVED2[16U]; /**< Reserved for future use **/
  __IOM uint32_t FREEZE;         /**< Freeze Register  */
  __IM uint32_t  SYNCBUSY;       /**< Synchronization Busy Register  */
  uint32_t       RESERVED3[10U]; /**< Reserved for future use **/
  __IOM uint32_t FRAMERATE;      /**< Frame Rate  */
  __IOM uint32_t SEGEN2;         /**< Segment Enable (32 to 39)  */
} LCD_TypeDef;                   /** @} */

/***************************************************************************//**
 * @addtogroup EFM32TG11B_LCD
 * @{
 * @defgroup EFM32TG11B_LCD_BitFields LCD Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for LCD CTRL */
#define _LCD_CTRL_RESETVALUE              0x00000000UL                       /**< Default value for LCD_CTRL */
#define _LCD_CTRL_MASK                    0x00800007UL                       /**< Mask for LCD_CTRL */
#define LCD_CTRL_EN                       (0x1UL << 0)                       /**< LCD Enable */
#define _LCD_CTRL_EN_SHIFT                0                                  /**< Shift value for LCD_EN */
#define _LCD_CTRL_EN_MASK                 0x1UL                              /**< Bit mask for LCD_EN */
#define _LCD_CTRL_EN_DEFAULT              0x00000000UL                       /**< Mode DEFAULT for LCD_CTRL */
#define LCD_CTRL_EN_DEFAULT               (_LCD_CTRL_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_SHIFT            1                                  /**< Shift value for LCD_UDCTRL */
#define _LCD_CTRL_UDCTRL_MASK             0x6UL                              /**< Bit mask for LCD_UDCTRL */
#define _LCD_CTRL_UDCTRL_DEFAULT          0x00000000UL                       /**< Mode DEFAULT for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_REGULAR          0x00000000UL                       /**< Mode REGULAR for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_FCEVENT          0x00000001UL                       /**< Mode FCEVENT for LCD_CTRL */
#define _LCD_CTRL_UDCTRL_FRAMESTART       0x00000002UL                       /**< Mode FRAMESTART for LCD_CTRL */
#define LCD_CTRL_UDCTRL_DEFAULT           (_LCD_CTRL_UDCTRL_DEFAULT << 1)    /**< Shifted mode DEFAULT for LCD_CTRL */
#define LCD_CTRL_UDCTRL_REGULAR           (_LCD_CTRL_UDCTRL_REGULAR << 1)    /**< Shifted mode REGULAR for LCD_CTRL */
#define LCD_CTRL_UDCTRL_FCEVENT           (_LCD_CTRL_UDCTRL_FCEVENT << 1)    /**< Shifted mode FCEVENT for LCD_CTRL */
#define LCD_CTRL_UDCTRL_FRAMESTART        (_LCD_CTRL_UDCTRL_FRAMESTART << 1) /**< Shifted mode FRAMESTART for LCD_CTRL */
#define LCD_CTRL_DSC                      (0x1UL << 23)                      /**< Direct Segment Control */
#define _LCD_CTRL_DSC_SHIFT               23                                 /**< Shift value for LCD_DSC */
#define _LCD_CTRL_DSC_MASK                0x800000UL                         /**< Bit mask for LCD_DSC */
#define _LCD_CTRL_DSC_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for LCD_CTRL */
#define LCD_CTRL_DSC_DEFAULT              (_LCD_CTRL_DSC_DEFAULT << 23)      /**< Shifted mode DEFAULT for LCD_CTRL */

/* Bit fields for LCD DISPCTRL */
#define _LCD_DISPCTRL_RESETVALUE          0x00103F00UL                          /**< Default value for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MASK                0x33703F17UL                          /**< Mask for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MUX_SHIFT           0                                     /**< Shift value for LCD_MUX */
#define _LCD_DISPCTRL_MUX_MASK            0x7UL                                 /**< Bit mask for LCD_MUX */
#define _LCD_DISPCTRL_MUX_DEFAULT         0x00000000UL                          /**< Mode DEFAULT for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MUX_STATIC          0x00000000UL                          /**< Mode STATIC for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MUX_DUPLEX          0x00000001UL                          /**< Mode DUPLEX for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MUX_TRIPLEX         0x00000002UL                          /**< Mode TRIPLEX for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MUX_QUADRUPLEX      0x00000003UL                          /**< Mode QUADRUPLEX for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MUX_SEXTAPLEX       0x00000005UL                          /**< Mode SEXTAPLEX for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MUX_OCTAPLEX        0x00000007UL                          /**< Mode OCTAPLEX for LCD_DISPCTRL */
#define LCD_DISPCTRL_MUX_DEFAULT          (_LCD_DISPCTRL_MUX_DEFAULT << 0)      /**< Shifted mode DEFAULT for LCD_DISPCTRL */
#define LCD_DISPCTRL_MUX_STATIC           (_LCD_DISPCTRL_MUX_STATIC << 0)       /**< Shifted mode STATIC for LCD_DISPCTRL */
#define LCD_DISPCTRL_MUX_DUPLEX           (_LCD_DISPCTRL_MUX_DUPLEX << 0)       /**< Shifted mode DUPLEX for LCD_DISPCTRL */
#define LCD_DISPCTRL_MUX_TRIPLEX          (_LCD_DISPCTRL_MUX_TRIPLEX << 0)      /**< Shifted mode TRIPLEX for LCD_DISPCTRL */
#define LCD_DISPCTRL_MUX_QUADRUPLEX       (_LCD_DISPCTRL_MUX_QUADRUPLEX << 0)   /**< Shifted mode QUADRUPLEX for LCD_DISPCTRL */
#define LCD_DISPCTRL_MUX_SEXTAPLEX        (_LCD_DISPCTRL_MUX_SEXTAPLEX << 0)    /**< Shifted mode SEXTAPLEX for LCD_DISPCTRL */
#define LCD_DISPCTRL_MUX_OCTAPLEX         (_LCD_DISPCTRL_MUX_OCTAPLEX << 0)     /**< Shifted mode OCTAPLEX for LCD_DISPCTRL */
#define LCD_DISPCTRL_WAVE                 (0x1UL << 4)                          /**< Waveform Selection */
#define _LCD_DISPCTRL_WAVE_SHIFT          4                                     /**< Shift value for LCD_WAVE */
#define _LCD_DISPCTRL_WAVE_MASK           0x10UL                                /**< Bit mask for LCD_WAVE */
#define _LCD_DISPCTRL_WAVE_DEFAULT        0x00000000UL                          /**< Mode DEFAULT for LCD_DISPCTRL */
#define _LCD_DISPCTRL_WAVE_LOWPOWER       0x00000000UL                          /**< Mode LOWPOWER for LCD_DISPCTRL */
#define _LCD_DISPCTRL_WAVE_NORMAL         0x00000001UL                          /**< Mode NORMAL for LCD_DISPCTRL */
#define LCD_DISPCTRL_WAVE_DEFAULT         (_LCD_DISPCTRL_WAVE_DEFAULT << 4)     /**< Shifted mode DEFAULT for LCD_DISPCTRL */
#define LCD_DISPCTRL_WAVE_LOWPOWER        (_LCD_DISPCTRL_WAVE_LOWPOWER << 4)    /**< Shifted mode LOWPOWER for LCD_DISPCTRL */
#define LCD_DISPCTRL_WAVE_NORMAL          (_LCD_DISPCTRL_WAVE_NORMAL << 4)      /**< Shifted mode NORMAL for LCD_DISPCTRL */
#define _LCD_DISPCTRL_CONTRAST_SHIFT      8                                     /**< Shift value for LCD_CONTRAST */
#define _LCD_DISPCTRL_CONTRAST_MASK       0x3F00UL                              /**< Bit mask for LCD_CONTRAST */
#define _LCD_DISPCTRL_CONTRAST_DEFAULT    0x0000003FUL                          /**< Mode DEFAULT for LCD_DISPCTRL */
#define LCD_DISPCTRL_CONTRAST_DEFAULT     (_LCD_DISPCTRL_CONTRAST_DEFAULT << 8) /**< Shifted mode DEFAULT for LCD_DISPCTRL */
#define _LCD_DISPCTRL_CHGRDST_SHIFT       20                                    /**< Shift value for LCD_CHGRDST */
#define _LCD_DISPCTRL_CHGRDST_MASK        0x700000UL                            /**< Bit mask for LCD_CHGRDST */
#define _LCD_DISPCTRL_CHGRDST_DISABLE     0x00000000UL                          /**< Mode DISABLE for LCD_DISPCTRL */
#define _LCD_DISPCTRL_CHGRDST_DEFAULT     0x00000001UL                          /**< Mode DEFAULT for LCD_DISPCTRL */
#define _LCD_DISPCTRL_CHGRDST_ONE         0x00000001UL                          /**< Mode ONE for LCD_DISPCTRL */
#define _LCD_DISPCTRL_CHGRDST_TWO         0x00000002UL                          /**< Mode TWO for LCD_DISPCTRL */
#define _LCD_DISPCTRL_CHGRDST_THREE       0x00000003UL                          /**< Mode THREE for LCD_DISPCTRL */
#define _LCD_DISPCTRL_CHGRDST_FOUR        0x00000004UL                          /**< Mode FOUR for LCD_DISPCTRL */
#define LCD_DISPCTRL_CHGRDST_DISABLE      (_LCD_DISPCTRL_CHGRDST_DISABLE << 20) /**< Shifted mode DISABLE for LCD_DISPCTRL */
#define LCD_DISPCTRL_CHGRDST_DEFAULT      (_LCD_DISPCTRL_CHGRDST_DEFAULT << 20) /**< Shifted mode DEFAULT for LCD_DISPCTRL */
#define LCD_DISPCTRL_CHGRDST_ONE          (_LCD_DISPCTRL_CHGRDST_ONE << 20)     /**< Shifted mode ONE for LCD_DISPCTRL */
#define LCD_DISPCTRL_CHGRDST_TWO          (_LCD_DISPCTRL_CHGRDST_TWO << 20)     /**< Shifted mode TWO for LCD_DISPCTRL */
#define LCD_DISPCTRL_CHGRDST_THREE        (_LCD_DISPCTRL_CHGRDST_THREE << 20)   /**< Shifted mode THREE for LCD_DISPCTRL */
#define LCD_DISPCTRL_CHGRDST_FOUR         (_LCD_DISPCTRL_CHGRDST_FOUR << 20)    /**< Shifted mode FOUR for LCD_DISPCTRL */
#define _LCD_DISPCTRL_BIAS_SHIFT          24                                    /**< Shift value for LCD_BIAS */
#define _LCD_DISPCTRL_BIAS_MASK           0x3000000UL                           /**< Bit mask for LCD_BIAS */
#define _LCD_DISPCTRL_BIAS_DEFAULT        0x00000000UL                          /**< Mode DEFAULT for LCD_DISPCTRL */
#define _LCD_DISPCTRL_BIAS_STATIC         0x00000000UL                          /**< Mode STATIC for LCD_DISPCTRL */
#define _LCD_DISPCTRL_BIAS_ONEHALF        0x00000001UL                          /**< Mode ONEHALF for LCD_DISPCTRL */
#define _LCD_DISPCTRL_BIAS_ONETHIRD       0x00000002UL                          /**< Mode ONETHIRD for LCD_DISPCTRL */
#define _LCD_DISPCTRL_BIAS_ONEFOURTH      0x00000003UL                          /**< Mode ONEFOURTH for LCD_DISPCTRL */
#define LCD_DISPCTRL_BIAS_DEFAULT         (_LCD_DISPCTRL_BIAS_DEFAULT << 24)    /**< Shifted mode DEFAULT for LCD_DISPCTRL */
#define LCD_DISPCTRL_BIAS_STATIC          (_LCD_DISPCTRL_BIAS_STATIC << 24)     /**< Shifted mode STATIC for LCD_DISPCTRL */
#define LCD_DISPCTRL_BIAS_ONEHALF         (_LCD_DISPCTRL_BIAS_ONEHALF << 24)    /**< Shifted mode ONEHALF for LCD_DISPCTRL */
#define LCD_DISPCTRL_BIAS_ONETHIRD        (_LCD_DISPCTRL_BIAS_ONETHIRD << 24)   /**< Shifted mode ONETHIRD for LCD_DISPCTRL */
#define LCD_DISPCTRL_BIAS_ONEFOURTH       (_LCD_DISPCTRL_BIAS_ONEFOURTH << 24)  /**< Shifted mode ONEFOURTH for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MODE_SHIFT          28                                    /**< Shift value for LCD_MODE */
#define _LCD_DISPCTRL_MODE_MASK           0x30000000UL                          /**< Bit mask for LCD_MODE */
#define _LCD_DISPCTRL_MODE_DEFAULT        0x00000000UL                          /**< Mode DEFAULT for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MODE_NOEXTCAP       0x00000000UL                          /**< Mode NOEXTCAP for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MODE_STEPDOWN       0x00000001UL                          /**< Mode STEPDOWN for LCD_DISPCTRL */
#define _LCD_DISPCTRL_MODE_CPINTOSC       0x00000002UL                          /**< Mode CPINTOSC for LCD_DISPCTRL */
#define LCD_DISPCTRL_MODE_DEFAULT         (_LCD_DISPCTRL_MODE_DEFAULT << 28)    /**< Shifted mode DEFAULT for LCD_DISPCTRL */
#define LCD_DISPCTRL_MODE_NOEXTCAP        (_LCD_DISPCTRL_MODE_NOEXTCAP << 28)   /**< Shifted mode NOEXTCAP for LCD_DISPCTRL */
#define LCD_DISPCTRL_MODE_STEPDOWN        (_LCD_DISPCTRL_MODE_STEPDOWN << 28)   /**< Shifted mode STEPDOWN for LCD_DISPCTRL */
#define LCD_DISPCTRL_MODE_CPINTOSC        (_LCD_DISPCTRL_MODE_CPINTOSC << 28)   /**< Shifted mode CPINTOSC for LCD_DISPCTRL */

