espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32TG11B/Include/efm32tg11b_lcd.h
/* Bit fields for LCD FRAMERATE */
#define _LCD_FRAMERATE_RESETVALUE         0x00000000UL                        /**< Default value for LCD_FRAMERATE */
#define _LCD_FRAMERATE_MASK               0x000001FFUL                        /**< Mask for LCD_FRAMERATE */
#define _LCD_FRAMERATE_FRDIV_SHIFT        0                                   /**< Shift value for LCD_FRDIV */
#define _LCD_FRAMERATE_FRDIV_MASK         0x1FFUL                             /**< Bit mask for LCD_FRDIV */
#define _LCD_FRAMERATE_FRDIV_DEFAULT      0x00000000UL                        /**< Mode DEFAULT for LCD_FRAMERATE */
#define LCD_FRAMERATE_FRDIV_DEFAULT       (_LCD_FRAMERATE_FRDIV_DEFAULT << 0) /**< Shifted mode DEFAULT for LCD_FRAMERATE */

/* Bit fields for LCD SEGEN2 */
#define _LCD_SEGEN2_RESETVALUE            0x00000000UL                      /**< Default value for LCD_SEGEN2 */
#define _LCD_SEGEN2_MASK                  0x0000000FUL                      /**< Mask for LCD_SEGEN2 */
#define _LCD_SEGEN2_SEGEN2_SHIFT          0                                 /**< Shift value for LCD_SEGEN2 */
#define _LCD_SEGEN2_SEGEN2_MASK           0xFUL                             /**< Bit mask for LCD_SEGEN2 */
#define _LCD_SEGEN2_SEGEN2_DEFAULT        0x00000000UL                      /**< Mode DEFAULT for LCD_SEGEN2 */
#define LCD_SEGEN2_SEGEN2_DEFAULT         (_LCD_SEGEN2_SEGEN2_DEFAULT << 0) /**< Shifted mode DEFAULT for LCD_SEGEN2 */

/** @} */
/** @} End of group EFM32TG11B_LCD */
/** @} End of group Parts */
